fedetft/miosix-kernel/miosix/arch/common/drivers/stm32u5_serial.cpp
/***************************************************************************
 *   Copyright (C) 2010-2018 by Terraneo Federico                          *
 *   Copyright (C) 2024 by Daniele Cattaneo                                *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/ 

#include <cstring>
#include <errno.h>
#include <termios.h>
#include "stm32u5_serial.h"
#include "stm32_serial_common.h"
#include "kernel/sync.h"
#include "filesystem/ioctl.h"
#include "cache/cortexMx_cache.h"
#include "interfaces/gpio.h"
#include "interfaces/interrupts.h"

using namespace std;

namespace miosix {

class STM32SerialDMAHW
{
public:
    inline DMA_TypeDef *get() const { return GPDMA1; }
    inline void IRQenable() const { STM32Bus::IRQen(STM32Bus::AHB1, RCC_AHB1ENR_GPDMA1EN); }
    inline void IRQdisable() const { STM32Bus::IRQdis(STM32Bus::AHB1, RCC_AHB1ENR_GPDMA1EN); }

    inline IRQn_Type getTxIRQn() const { return txIrq; }
    inline unsigned long getTxCSR() const { return getCSR(txChannel); }

    inline IRQn_Type getRxIRQn() const { return rxIrq; }
    inline unsigned long getRxCSR() const { return getCSR(rxChannel); }

    inline void IRQinit() { 
        tx = GPDMA1_Channel0;
        txIrq = GPDMA1_Channel0_IRQn;
        txChannel = 0;

        rx = GPDMA1_Channel1;
        rxIrq = GPDMA1_Channel1_IRQn;
        rxChannel = 1;
    }

    inline void startDmaWrite(volatile uint32_t *dr, const char *buffer, size_t size) const
    {
        if (size == 0)
            return;
        size--;

        tx->CSAR = reinterpret_cast<unsigned int>(buffer);
        tx->CDAR = reinterpret_cast<unsigned int>(dr);

        tx->CTR1 = DMA_CTR1_SINC
                 | ((size & 63) << DMA_CTR1_SBL_1_Pos)
                 | (1 << DMA_CTR1_DAP_Pos)
                 ;
        // 25 == Usart1 - tx
        tx->CTR2 = (25 << DMA_CTR2_REQSEL_Pos)
                 ;

        tx->CCR = DMA_CCR_EN
                | DMA_CCR_TCIE
                | DMA_CCR_DTEIE
                | DMA_CCR_PRIO_1; // priorità media
    }

    inline void IRQhandleDmaTxInterrupt() const
    {
        tx->CFCR = DMA_CFCR_TCF | DMA_CFCR_DTEF;
    }

    inline void IRQwaitDmaWriteStop() const
    {
        while((tx->CCR & DMA_CCR_EN) && !(getTxCSR() & (DMA_CSR_TCF|DMA_CSR_DTEF))) ;
    }

    inline void IRQstartDmaRead(volatile uint32_t *dr, char *buffer, unsigned int size) const
    {
        /*
        rx->CSAR = reinterpret_cast<unsigned int>(dr);
        rx->CDAR = reinterpret_cast<unsigned int>(buffer);
        rx->CTR1 = (size << DMA_CTR1_SDW_LOG2_Pos) | DMA_CTR1_DINC;
        rx->CCR = DMA_CCR_EN
                | DMA_CCR_TCIE
                | DMA_CCR_DTEIE
                | DMA_CCR_PRIO_1;
        */
    }

    inline int IRQstopDmaRead() const
    {
        return 0;
        /*
        rx->CCR &= ~DMA_CCR_EN;
        while(rx->CCR & DMA_CCR_EN) ;
        rx->CFCR = DMA_CFCR_TCF | DMA_CFCR_DTEF;
        return rx->CTR1 & 0xFFFF; // numero di dati residui
        */
    }

    STM32Bus::ID bus;           ///< Bus where the DMA port is (AHB1)
    unsigned long clkEnMask;    ///< DMA clock enable bit

    DMA_Channel_TypeDef *tx;    ///< Pointer to DMA TX channel
    IRQn_Type txIrq;            ///< DMA TX channel IRQ number
    unsigned char txChannel;    ///< DMA TX channel index

    DMA_Channel_TypeDef *rx;    ///< Pointer to DMA RX channel
    IRQn_Type rxIrq;            ///< DMA RX channel IRQ number
    unsigned char rxChannel;    ///< DMA RX channel index

private:
    inline unsigned long getCSR(unsigned char ch) const
    {
        if(ch == 0)
            return GPDMA1_Channel0->CSR;
        else if(ch == 1)
            return GPDMA1_Channel1->CSR;
        return GPDMA1_Channel2->CSR;
    }
};


/*
 * Auxiliary class that encapsulates all parts of code that differ between
 * between each instance of the USART peripheral.
 * 
 * Try not to use the attributes of this class directly even if they are public.
 */

class STM32SerialHW
{
public:
    inline USART_TypeDef *get() const { return port; }
    inline IRQn_Type getIRQn() const { return irq; }
    inline STM32SerialAltFunc const & getAltFunc() const { return altFunc; }
    inline unsigned int IRQgetClock() const { return STM32Bus::getClock(bus); }
    inline void IRQenable() const { STM32Bus::IRQen(bus, clkEnMask); }
    inline void IRQdisable() const { STM32Bus::IRQdis(bus, clkEnMask); }
    inline const STM32SerialDMAHW& getDma() const { return dma; }

    inline void setBaudRate(unsigned int baudrate) const
    {
        unsigned int freq=IRQgetClock();
        if(isLowPower)
        {
            freq/=1000000;
            unsigned int fac=1000000U*4096U/baudrate;
            port->BRR=((fac*freq)+8)/16;
        } else {
            unsigned int quot=2*freq/baudrate; //2*freq for round to nearest
            port->BRR=quot/2 + (quot & 1);     //Round to nearest
        }
    }

    USART_TypeDef *port;        ///< USART port
    IRQn_Type irq;              ///< USART IRQ number
    STM32SerialAltFunc altFunc; ///< Alternate function to set for GPIOs
    bool isLowPower;            ///< If it is a LPUART or not
    STM32Bus::ID bus;           ///< Bus where the port is (APB1 or 2)
    unsigned long clkEnMask;    ///< USART clock enable

    STM32SerialDMAHW dma;
};

/*
 * Table of hardware configurations
 */

#if defined(STM32U585xx)
// 0: USART1; 1: USART2; 2: USART3; 3: UART4; 4: UART5; 6: LPUART1
constexpr int maxPorts = 6;

static const STM32SerialHW ports[maxPorts] = {
    { USART1, USART1_IRQn, {7},   false, STM32Bus::APB2, RCC_APB2ENR_USART1EN},
    { USART2, USART2_IRQn, {7},   false, STM32Bus::APB1L, RCC_APB1ENR1_USART2EN},
    { USART3, USART3_IRQn, {7},   false, STM32Bus::APB1L, RCC_APB1ENR1_USART3EN},
    { UART4,  UART4_IRQn,  {8},    false, STM32Bus::APB1L, RCC_APB1ENR1_UART4EN},
    { UART5,  UART5_IRQn,  {8},    false, STM32Bus::APB1L, RCC_APB1ENR1_UART5EN},
    { LPUART1, LPUART1_IRQn, {8}, true, STM32Bus::APB3, RCC_APB3ENR_LPUART1EN},
};

#else
// STM32U535xx has different alternate functions!
#error Unsupported STM32 chip for this serial driver
#endif

//
// class STM32SerialBase
//

// A note on the baudrate/500: the buffer is selected so as to withstand
// 20ms of full data rate. In the 8N1 format one char is made of 10 bits.
// So (baudrate/10)*0.02=baudrate/500
STM32SerialBase::STM32SerialBase(int id, int baudrate, bool flowControl) : 
    flowControl(flowControl), portId(id), rxQueue(rxQueueMin+baudrate/500)
{
    if(id<1 || id>maxPorts) errorHandler(Error::UNEXPECTED);
    port=&ports[id-1];
    if(port->get()==nullptr) errorHandler(Error::UNEXPECTED);
}

void STM32SerialBase::commonInit(int id, int baudrate, GpioPin tx, GpioPin rx,
                    GpioPin rts, GpioPin cts)
{
    port->getAltFunc().set(tx);
    port->getAltFunc().set(rx,true); //Pullup: prevent spurious rx if unconnected
    if(flowControl)
    {
        port->getAltFunc().set(rts);
        port->getAltFunc().set(cts);
    }
    port->setBaudRate(baudrate);
    if(flowControl==false) port->get()->CR3 |= USART_CR3_ONEBIT;
    else port->get()->CR3 |= USART_CR3_ONEBIT | USART_CR3_RTSE | USART_CR3_CTSE;
}

void STM32SerialBase::IRQwrite(const char *str)
{
    while(*str)
    {
        while((port->get()->ISR & USART_ISR_TXE)==0) ;
        port->get()->TDR=*str++;
    }
    waitSerialTxFifoEmpty();
}

inline void STM32SerialBase::waitSerialTxFifoEmpty()
{
    while((port->get()->ISR & USART_ISR_TC)==0) ;
}

ssize_t STM32SerialBase::readFromRxQueue(void *buffer, size_t size)
{
    Lock<KernelMutex> l(rxMutex);
    char *buf=reinterpret_cast<char*>(buffer);
    size_t result=0;
    FastGlobalIrqLock dLock;
    DeepSleepLock dpLock;
    for(;;)
    {
        //Try to get data from the queue
        for(;result<size;result++)
        {
            if(rxQueue.tryGet(buf[result])==false) break;
            //This is here just not to keep IRQ disabled for the whole loop
            FastGlobalIrqUnlock eLock(dLock);
        }
        if(idle && result>0) break;
        if(result==size) break;
        //Wait for data in the queue
        rxWaiting=Thread::IRQgetCurrentThread();
        do Thread::IRQglobalIrqUnlockAndWait(dLock); while(rxWaiting);
    }
    return result;
}

void STM32SerialBase::rxWakeup()
{
    if(rxWaiting)
    {
        rxWaiting->IRQwakeup();
        rxWaiting=nullptr;
    }
}

int STM32SerialBase::ioctl(int cmd, void* arg)
{
    if(reinterpret_cast<unsigned>(arg) & 0b11) return -EFAULT; //Unaligned
    termios *t=reinterpret_cast<termios*>(arg);
    switch(cmd)
    {
        case IOCTL_SYNC:
            waitSerialTxFifoEmpty();
            return 0;
        case IOCTL_TCGETATTR:
            t->c_iflag=IGNBRK | IGNPAR;
            t->c_oflag=0;
            t->c_cflag=CS8 | (flowControl ? CRTSCTS : 0);
            t->c_lflag=0;
            return 0;
        case IOCTL_TCSETATTR_NOW:
        case IOCTL_TCSETATTR_DRAIN:
        case IOCTL_TCSETATTR_FLUSH:
            //Changing things at runtime unsupported, so do nothing, but don't
            //return error as console_device.h implements some attribute changes
            return 0;
        default:
            return -ENOTTY; //Means the operation does not apply to this descriptor
    }
}

//
// class STM32Serial
//

STM32Serial::STM32Serial(int id, int baudrate, GpioPin tx, GpioPin rx)
    : STM32SerialBase(id,baudrate,false), Device(Device::TTY)
{
    commonInit(id,baudrate,tx,rx,tx,rx); //The last two args will be ignored
}

STM32Serial::STM32Serial(int id, int baudrate, GpioPin tx, GpioPin rx,
                         GpioPin rts, GpioPin cts)
    : STM32SerialBase(id,baudrate,true), Device(Device::TTY)
{
    commonInit(id,baudrate,tx,rx,rts,cts);
}

void STM32Serial::commonInit(int id, int baudrate, GpioPin tx, GpioPin rx,
                             GpioPin rts, GpioPin cts)
{
    GlobalIrqLock dLock;
    port->IRQenable();

    IRQregisterIrq(dLock,port->getIRQn(),&STM32Serial::IRQhandleInterrupt,this);
    STM32SerialBase::commonInit(id,baudrate,tx,rx,rts,cts);
    //Enabled, 8 data bit, no parity, interrupt on character rx
    port->get()->CR1 = USART_CR1_UE     //Enable port
                     | USART_CR1_RXNEIE //Interrupt on data received
                     | USART_CR1_IDLEIE //Interrupt on idle line
                     | USART_CR1_TE     //Transmission enbled
                     | USART_CR1_RE;    //Reception enabled
}

ssize_t STM32Serial::readBlock(void *buffer, size_t size, off_t where)
{
    return STM32SerialBase::readFromRxQueue(buffer, size);
}

ssize_t STM32Serial::writeBlock(const void *buffer, size_t size, off_t where)
{
    Lock<KernelMutex> l(txMutex);
    DeepSleepLock dpLock;
    const char *buf=reinterpret_cast<const char*>(buffer);
    for(size_t i=0;i<size;i++)
    {
        while((port->get()->ISR & USART_ISR_TXE)==0) ;
        port->get()->TDR=*buf++;
    }
    return size;
}

void STM32Serial::IRQhandleInterrupt()
{
    unsigned int status=port->get()->ISR;
    char c;
    rxUpdateIdle(status);
    if(status & USART_ISR_RXNE)
    {
        //Always read data, since this clears interrupt flags
        c=port->get()->RDR;
        //If no error put data in buffer
        if((status & USART_ISR_FE)==0)
            if(rxQueuePut(c)==false) /*fifo overflow*/;
    }
    if(status & USART_ISR_IDLE)
    {
        port->get()->ICR=USART_ICR_IDLECF; //clears interrupt flags
    }
    if((status & USART_ISR_IDLE) || rxQueue.size()>=rxQueueMin)
    {
        //Enough data in buffer or idle line, awake thread
        rxWakeup();
    }
}

void STM32Serial::IRQwrite(const char *str)
{
    STM32SerialBase::IRQwrite(str);
}

STM32Serial::~STM32Serial()
{
    waitSerialTxFifoEmpty();
    {
        GlobalIrqLock dLock;
        port->get()->CR1=0;
        IRQunregisterIrq(dLock,port->getIRQn(),&STM32Serial::IRQhandleInterrupt,this);
        port->IRQdisable();
    }
}

//
// class STM32DmaSerial
//

STM32DmaSerial::STM32DmaSerial(int id, int baudrate, GpioPin tx, GpioPin rx)
    : STM32SerialBase(id,baudrate,false), Device(Device::TTY)
{
    commonInit(id,baudrate,tx,rx,tx,rx); //The last two args will be ignored
}

STM32DmaSerial::STM32DmaSerial(int id, int baudrate, GpioPin tx, GpioPin rx,
            GpioPin rts, GpioPin cts)
    : STM32SerialBase(id,baudrate,true), Device(Device::TTY)
{
    commonInit(id,baudrate,tx,rx,rts,cts);
}

void STM32DmaSerial::commonInit(int id, int baudrate, GpioPin tx, GpioPin rx,
                    GpioPin rts, GpioPin cts)
{
    //Check if DMA is supported for this port
    auto dma=port->getDma();
    if(!dma.get()) errorHandler(Error::UNEXPECTED);
    GlobalIrqLock dLock;

    dma.IRQenable();
    dma.IRQinit();
    IRQregisterIrq(dLock,dma.getTxIRQn(),&STM32DmaSerial::IRQhandleDmaTxInterrupt,this);
    IRQregisterIrq(dLock,dma.getRxIRQn(),&STM32DmaSerial::IRQhandleDmaRxInterrupt,this);

    port->IRQenable();
    //Lower priority to ensure IRQhandleDmaRxInterrupt() is called before
    //IRQhandleInterrupt(), so that idle is set correctly
    NVIC_SetPriority(port->getIRQn(),defaultIrqPriority+1);
    IRQregisterIrq(dLock,port->getIRQn(),&STM32DmaSerial::IRQhandleInterrupt,this);

    STM32SerialBase::commonInit(id,baudrate,tx,rx,rts,cts);

    port->get()->CR3 = USART_CR3_DMAT | USART_CR3_DMAR; //Enable USART DMA
    port->get()->CR1 = USART_CR1_UE     //Enable port
                     | USART_CR1_IDLEIE //Interrupt on idle line
                     | USART_CR1_TE     //Transmission enbled
                     | USART_CR1_RE;    //Reception enabled
    //IRQstartDmaRead();
}

ssize_t STM32DmaSerial::writeBlock(const void *buffer, size_t size, off_t where)
{
    Lock<KernelMutex> l(txMutex);
    DeepSleepLock dpLock;
    const char *buf=reinterpret_cast<const char*>(buffer);
    size_t remaining=size;
    //If the client-provided buffer is not in CCM, we can use it directly
    //as DMA source memory (zero copy).
    if(isInCCMarea(buf)==false) 
    {
        //We don't use zero copy for the last txBufferSize bytes because in this
        //way we can return from this function a bit earlier.
        //If we returned while the DMA was still reading from the client
        //buffer, and the buffer is immediately rewritten, shit happens
        while(remaining>txBufferSize)
        {
            //DMA is limited to 64K
            size_t transferSize=min<size_t>(remaining-txBufferSize,65535);
            waitDmaWriteEnd();
            startDmaWrite(buf,transferSize);
            buf+=transferSize;
            remaining-=transferSize;
        }
    }
    //DMA out all remaining data through txBuffer
    while(remaining>0)
    {
        size_t transferSize=min(remaining,static_cast<size_t>(txBufferSize));
        waitDmaWriteEnd();
        //Copy to txBuffer only after DMA xfer completed, as the previous
        //xfer may be using the same buffer
        memcpy(txBuffer,buf,transferSize);
        startDmaWrite(txBuffer,transferSize);
        buf+=transferSize;
        remaining-=transferSize;
    }
    #ifdef WITH_DEEP_SLEEP
    //The serial driver by default can return even though the last part of
    //the data is still being transmitted by the DMA. When using deep sleep
    //however the DMA operation needs to be fully enclosed by a deep sleep
    //lock to prevent the scheduler from stopping peripheral clocks.
    waitDmaWriteEnd();
    waitSerialTxFifoEmpty(); //TODO: optimize by doing it only when entering deep sleep
    #endif //WITH_DEEP_SLEEP
    return size;
}

void STM32DmaSerial::startDmaWrite(const char *buffer, size_t size)
{
    markBufferBeforeDmaWrite(buffer,size);
    DeepSleepLock dpLock;
    //The TC (Transfer Complete) bit in the Status Register (SR) of the serial
    //port can be reset by writing to it directly, or by first reading it
    //out and then writing to the Data Register (DR).
    //  The waitSerialTxFifoEmpty() function relies on the status of TC to
    //accurately reflect whether the serial port is pushing out bytes or not,
    //so it is extremely important for TC to *only* be reset at the beginning of
    //a transmission.
    //  Since the DMA peripheral only writes to DR and never reads from SR,
    //we must read from SR manually first to ensure TC is cleared as soon as
    //the DMA writes to it -- and not earlier!
    //  The alternative is to zero out TC by hand, but if we do that TC becomes
    //unreliable as a flag. Consider the case in which we are clearing out TC
    //in this routine before configuring the DMA. If the DMA fails to start due
    //to an error, or the CPU is reset before the DMA transfer is started, the
    //USART won't be pushing out bytes but TC will still be zero. As a result,
    //waitSerialTxFifoEmpty() will loop forever waiting for the end of a
    //transfer that is not happening.
    while((port->get()->ISR & USART_ISR_TXE)==0) ;
    
    dmaTxInProgress=true;
    //The reinterpret cast is needed because ST, in its infinite wisdom, decided
    //that in L4 headers this register is now 16 bit. Please, nameless engineers
    //at ST, stop fighting on the names and register definitions!
    port->getDma().startDmaWrite(
        reinterpret_cast<volatile uint32_t *>(&port->get()->TDR),buffer,size);
}

void STM32DmaSerial::IRQhandleDmaTxInterrupt()
{
    port->getDma().IRQhandleDmaTxInterrupt();
    dmaTxInProgress=false;
    if(txWaiting==nullptr) return;
    txWaiting->IRQwakeup();
    txWaiting=nullptr;
}

void STM32DmaSerial::waitDmaWriteEnd()
{
    FastGlobalIrqLock dLock;
    // If a previous DMA xfer is in progress, wait
    if(dmaTxInProgress)
    {
        txWaiting=Thread::IRQgetCurrentThread();
        do Thread::IRQglobalIrqUnlockAndWait(dLock); while(txWaiting);
    }
}

ssize_t STM32DmaSerial::readBlock(void *buffer, size_t size, off_t where)
{
    return STM32SerialBase::readFromRxQueue(buffer, size);
}

void STM32DmaSerial::IRQstartDmaRead()
{
    port->getDma().IRQstartDmaRead(
        reinterpret_cast<volatile uint32_t *>(&port->get()->RDR),
        rxBuffer,rxQueueMin);
}

int STM32DmaSerial::IRQstopDmaRead()
{
    return rxQueueMin - port->getDma().IRQstopDmaRead();
}

void STM32DmaSerial::IRQflushDmaReadBuffer()
{
    int elem=IRQstopDmaRead();
    markBufferAfterDmaRead(rxBuffer,rxQueueMin);
    for(int i=0;i<elem;i++)
        if(rxQueue.tryPut(rxBuffer[i])==false) /*fifo overflow*/;
    IRQstartDmaRead();
}

void STM32DmaSerial::IRQhandleDmaRxInterrupt()
{
    IRQflushDmaReadBuffer();
    rxUpdateIdle(0);
    rxWakeup();
}

void STM32DmaSerial::IRQhandleInterrupt()
{
    unsigned int status=port->get()->ISR;
    rxUpdateIdle(status);
    if(status & USART_ISR_IDLE)
    {
        port->get()->ICR=USART_ICR_IDLECF; //clears interrupt flags
        IRQflushDmaReadBuffer();
    }
    if((status & USART_ISR_IDLE) || rxQueue.size()>=rxQueueMin)
    {
        //Enough data in buffer or idle line, awake thread
        rxWakeup();
    }
}

void STM32DmaSerial::IRQwrite(const char *str)
{
    //Wait until DMA xfer ends. EN bit is cleared by hardware on transfer end
    port->getDma().IRQwaitDmaWriteStop();
    STM32SerialBase::IRQwrite(str);
}

STM32DmaSerial::~STM32DmaSerial()
{
    waitSerialTxFifoEmpty();
    {
        GlobalIrqLock dLock;
        port->get()->CR1=0;
        IRQstopDmaRead();
        auto dma=port->getDma();
        IRQunregisterIrq(dLock,dma.getTxIRQn(),&STM32DmaSerial::IRQhandleDmaTxInterrupt,this);
        IRQunregisterIrq(dLock,dma.getRxIRQn(),&STM32DmaSerial::IRQhandleDmaRxInterrupt,this);
        IRQunregisterIrq(dLock,port->getIRQn(),&STM32DmaSerial::IRQhandleInterrupt,this);
        port->IRQdisable();
    }
}

} //namespace miosix
